app/controllers/songs_controller.rb

  def upload
      #Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
      CSV.foreach(params[:songs].path, headers: true) do |song|
          binding.pry
          @song = Song.create(title: song[0])
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2016-02-07 22:39:04.964280"], ["updated_at", "2016-02-07 22:39:04.964280"]]